# На чем-то нужно обрабатывать "несерверный" JS. Выбрана нода как самый простой вариант.
# Возможн проблемы с совместимостью
# TODO: обложить тестами на тему исполняемости JS в node.
# TODO: собрать образ с готовыми зависимостями и собирать из него (ну... когда тяжелые зависимости появятся)
FROM node:24-alpine
# Не меняйте без причины.
ENV PORT=8080
ARG PORT=${PORT}
WORKDIR /app

# Копируем package.json и устанавливаем зависимости (их нет, но сказано "надо" - значит "надо" и будущие поколения скажут спасибо)
COPY code/package.json code/package-lock.json /app/
RUN npm ci

# Копируем исходные файлы
COPY /code/ /app/

# Открываем порт
EXPOSE ${PORT}

# Запускаем сервер
CMD ["node", "server.js"]